load-tests/artillery-config.yml
config:
  target: "http://localhost:8081"
  phases:
    - duration: 60
      arrivalRate: 100
      name: "Sustained load - 100 VUs"
scenarios:
  - name: "User browsing flow"
    flow:
      - get:
          url: "/"
      - think: 1
      - get:
          url: "/login"
      - think: 1
      - get:
          url: "/routes"